TexasInstruments/mcupsdk-enet-lld/examples/tsn/aafpcm_audio_etherring_demo/central_compute/am275x-evm-dp83867/am275x-evm/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM275x" --part "AM2754" --package "ANJ" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2754" --package "FCCSP (ANJ)" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.2+4234"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom     = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1    = eeprom.addInstance();
const eeprom2    = eeprom.addInstance();
const eeprom3    = eeprom.addInstance();
const gpio       = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const gpio4      = gpio.addInstance();
const gpio5      = gpio.addInstance();
const gpio6      = gpio.addInstance();
const gpio7      = gpio.addInstance();
const gpio8      = gpio.addInstance();
const gpio9      = gpio.addInstance();
const gpio10     = gpio.addInstance();
const gpio11     = gpio.addInstance();
const i2c        = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1       = i2c.addInstance();
const i2c2       = i2c.addInstance();
const i2c3       = i2c.addInstance();
const ipc        = scripting.addModule("/drivers/ipc/ipc");
const mcasp      = scripting.addModule("/drivers/mcasp/mcasp", {}, false);
const mcasp1     = mcasp.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();
const timer      = scripting.addModule("/kernel/dpl/timer", {}, false);
const timer1     = timer.addInstance();
const timer2     = timer.addInstance();
const enet_cpsw  = scripting.addModule("/networking/enet_cpsw/enet_cpsw", {}, false);
const enet_cpsw1 = enet_cpsw.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

eeprom2.$name      = "RGMII1_EEPROM";
eeprom2.i2cAddress = 0x57;

eeprom3.$name      = "RGMII2_EEPROM";
eeprom3.i2cAddress = 0x56;

gpio1.$name        = "CONFIG_CENTRAL_OUT_P1";
gpio1.pinDir       = "OUTPUT";
gpio1.GPIO.$assign = "MCASP4_ACLKX";

gpio2.$name        = "CONFIG_CENTRAL_OUT_P2";
gpio2.pinDir       = "OUTPUT";
gpio2.GPIO.$assign = "MCASP0_AXR10";

gpio3.$name        = "CONFIG_CENTRAL_OUT_P3";
gpio3.pinDir       = "OUTPUT";
gpio3.GPIO.$assign = "MCASP0_AXR11";

gpio4.pinDir       = "OUTPUT";
gpio4.$name        = "CONFIG_CENTRAL_OUT_Q1";
gpio4.GPIO.$assign = "MLB0_MLBDAT";

gpio5.pinDir       = "OUTPUT";
gpio5.$name        = "CONFIG_CENTRAL_OUT_Q2";
gpio5.GPIO.$assign = "MLB0_MLBCLK";

gpio6.pinDir       = "OUTPUT";
gpio6.$name        = "CONFIG_CENTRAL_OUT_Q3";
gpio6.GPIO.$assign = "MCASP4_AXR0";

gpio7.$name                    = "GPIO_STBY_AEC1_TAS0";
gpio7.pinDir                   = "OUTPUT";
gpio7.useMcuGpioPins           = true;
gpio7.MCU_GPIO.$assign         = "MCU_GPIO0_15";
gpio7.MCU_GPIO.gpioPin.$assign = "MCU_GPIO0_15";

gpio8.$name        = "GPIO_STBY_AEC1_TAS1";
gpio8.pinDir       = "OUTPUT";
gpio8.GPIO.$assign = "OSPI0_CSn1";

gpio9.$name                    = "GPIO_STBY_AEC2_TAS0";
gpio9.pinDir                   = "OUTPUT";
gpio9.useMcuGpioPins           = true;
gpio9.MCU_GPIO.$assign         = "MCU_GPIO0_4";
gpio9.MCU_GPIO.gpioPin.$assign = "MCU_GPIO0_4";

gpio10.$name                    = "GPIO_STBY_AEC2_TAS1";
gpio10.pinDir                   = "OUTPUT";
gpio10.useMcuGpioPins           = true;
gpio10.MCU_GPIO.$assign         = "MCU_GPIO0_3";
gpio10.MCU_GPIO.gpioPin.$assign = "MCU_GPIO0_3";

gpio11.$name        = "CONFIG_TEST_GPIO";
gpio11.pinDir       = "OUTPUT";
gpio11.GPIO.$assign = "MLB0_MLBSIG";

i2c1.$name               = "CONFIG_I2C0";
eeprom1.peripheralDriver = i2c1;
eeprom2.peripheralDriver = i2c1;
eeprom3.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template0";

i2c2.$name           = "CONFIG_I2C1";
i2c2.I2C.$assign     = "I2C3";
i2c2.I2C.SCL.$assign = "UART0_CTSn";
i2c2.I2C.SDA.$assign = "UART0_RTSn";
i2c2.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template1";

i2c3.$name           = "CONFIG_I2C2";
i2c3.I2C.$assign     = "I2C5";
i2c3.I2C.SCL.$assign = "MCAN0_TX";
i2c3.I2C.SDA.$assign = "MCAN0_RX";
i2c3.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template2";

ipc.wkup_r5fss0_0 = "NONE";
ipc.r5fss0_1      = "NONE";
ipc.r5fss1_0      = "NONE";
ipc.r5fss1_1      = "NONE";
ipc.c75ss1_0      = "NONE";
ipc.c75ss0_0      = "notify";

mcasp["TISCI_DEV_MCASP<n>_AUXCLK_SEL_DEV_VD_CLK_PARENT_BOARD_0_AUDIO_EXT_REFCLK2_OUT"] = "24576000";

mcasp1.$name                                   = "CONFIG_MCASP4";
mcasp1.enableLoopback                          = false;
mcasp1.skipDriverOpen                          = true;
mcasp1.enableMcaspRx                           = false;
mcasp1.txActiveSlotMask                        = 0x3;
mcasp1.txDataMask                              = 0xFFFFFFFF;
mcasp1.afsx                                    = 0;
mcasp1.txLoopjobBuf                            = "gTxLoopjobBuf1";
mcasp1.masterClkx                              = 1024;
mcasp1.txCallbackFxn                           = "TsMcasp_TxCb";
mcasp1.mcasp_auxclk_gf_sel                     = "1";
mcasp1.aux_clk_sel                             = "5";
mcasp1.fsx                                     = 0.3;
mcasp1.txHclkDiv                               = 40;
mcasp1.txClkDiv                                = 32;
mcasp1.txHclkCalculated                        = 614400;
mcasp1.txBclkCalculated                        = 19200;
mcasp1.txFsyncCalculated                       = 300;
mcasp1.txClkApplyAlert                         = false;
mcasp1.rxHclkDiv                               = 40;
mcasp1.rxClkDiv                                = 32;
mcasp1.rxHclkCalculated                        = 614400;
mcasp1.rxBclkCalculated                        = 19200;
mcasp1.rxFsyncCalculated                       = 300;
mcasp1.rxClkApplyAlert                         = false;
mcasp1.CLOCKING.$assignAllowConflicts          = "CLOCKING";
mcasp1.mcaspSer.create(1);
mcasp1.mcaspSer[0].$name                       = "CONFIG_MCASP_SER2";
mcasp1.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP4";
mcasp1.mcaspSer[0].MCASP.AXR0.$used            = false;
mcasp1.MCASP.$assignAllowConflicts             = "MCASP4";
mcasp1.MCASP.AFSX.$assign                      = "MCASP4_AFSX";
mcasp1.MCASP.ACLKX.$used                       = false;
scripting.suppress("Resource conflict,MCASP4 is also in use by @@@.+?@@@", mcasp1.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP4 is also in use by @@@.+?@@@", mcasp1.MCASP, "$assign");

const udma         = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1        = udma.addInstance({}, false);
udma1.$name        = "CONFIG_UDMA0";
mcasp1.bcDmaDriver = udma1;

debug_log.enableLogZoneInfo        = true;
debug_log.enableCssLog             = false;
debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.$assign     = "UART2";
debug_log.uartLog.UART.RXD.$assign = "MCASP0_AXR6";
debug_log.uartLog.UART.TXD.$assign = "SPI1_CS1";

mpu_armv71.size         = 31;
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;
mpu_armv71.$name        = "REGISTERS";

mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.$name             = "TCMA";

mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.$name             = "TCMB";

mpu_armv74.$name    = "MSRAM_BANK0_TO_BANK3";
mpu_armv74.baseAddr = 0x72000000;
mpu_armv74.size     = 22;

mpu_armv75.$name      = "MSRAM_BANK4_TO_BANK5";
mpu_armv75.baseAddr   = 0x72400000;
mpu_armv75.size       = 19;
mpu_armv75.attributes = "NonCached";

mpu_armv76.$name        = "MCASP1";
mpu_armv76.baseAddr     = 0x2B10000;
mpu_armv76.size         = 13;
mpu_armv76.attributes   = "Device";
mpu_armv76.allowExecute = false;

timer1.$name         = "CONFIG_TIMER0";
timer1.timerCallback = "avbTickTimer_callback";
timer1.usecPerTick   = 124;

timer2.timerCallback = "controlData_tick";
timer2.$name         = "CONFIG_CTRL_TICK";
timer2.usecPerTick   = 250;

enet_cpsw1.$name                          = "CONFIG_ENET_CPSW0";
enet_cpsw1.mdioPollEnMask                 = [];
enet_cpsw1.hostportRxMtu                  = 1522;
enet_cpsw1.macport1RxMtu                  = 1522;
enet_cpsw1.macport2RxMtu                  = 1522;
enet_cpsw1.macAddrList                    = "70:ff:76:1d:e7:f2,70:ff:76:1d:e8:e3";
enet_cpsw1.LargePoolPktCount              = 76;
enet_cpsw1.txDmaChannel.create(4);
enet_cpsw1.txDmaChannel[0].$name          = "ENET_DMA_TX_CH0";
enet_cpsw1.txDmaChannel[0].PacketsCount   = 10;
enet_cpsw1.txDmaChannel[1].$name          = "ENET_DMA_TX_CH_PTP";
enet_cpsw1.txDmaChannel[1].PacketsCount   = 4;
enet_cpsw1.txDmaChannel[2].$name          = "ENET_DMA_TX_CH_AVTP";
enet_cpsw1.txDmaChannel[2].PacketsCount   = 8;
enet_cpsw1.txDmaChannel[3].$name          = "ENET_DMA_TX_ETHERRING";
enet_cpsw1.txDmaChannel[3].PacketsCount   = 8;
enet_cpsw1.rxDmaChannel.create(4);
enet_cpsw1.rxDmaChannel[0].$name          = "ENET_DMA_RX_CH0";
enet_cpsw1.rxDmaChannel[0].useGlobalEvt   = true;
enet_cpsw1.rxDmaChannel[0].PacketsCount   = 2;
enet_cpsw1.rxDmaChannel[1].$name          = "ENET_DMA_RX_CH_PTP";
enet_cpsw1.rxDmaChannel[1].macAddrCount   = 0;
enet_cpsw1.rxDmaChannel[1].useGlobalEvt   = true;
enet_cpsw1.rxDmaChannel[1].useDefaultFlow = false;
enet_cpsw1.rxDmaChannel[1].PacketsCount   = 4;
enet_cpsw1.rxDmaChannel[2].$name          = "ENET_DMA_RX_CH_AVTP";
enet_cpsw1.rxDmaChannel[2].macAddrCount   = 0;
enet_cpsw1.rxDmaChannel[2].useGlobalEvt   = true;
enet_cpsw1.rxDmaChannel[2].useDefaultFlow = false;
enet_cpsw1.rxDmaChannel[2].PacketsCount   = 16;
enet_cpsw1.rxDmaChannel[3].$name          = "ENET_DMA_RX_ETHERRING";
enet_cpsw1.rxDmaChannel[3].useDefaultFlow = false;
enet_cpsw1.rxDmaChannel[3].macAddrCount   = 0;
enet_cpsw1.rxDmaChannel[3].PacketsCount   = 16;
enet_cpsw1.rxDmaChannel[3].useGlobalEvt   = true;

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_cpsw1.ethphy1       = ethphy_cpsw_icssg1;

const ethphy_cpsw_icssg2 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg2.$name = "CONFIG_ENET_ETHPHY1";
enet_cpsw1.ethphy2       = ethphy_cpsw_icssg2;

const udma2        = udma.addInstance({}, false);
enet_cpsw1.udmaDrv = udma2;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.SCL.$suggestSolution             = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution             = "I2C0_SDA";
timer1.TIMER.$suggestSolution             = "TIMER7";
timer2.TIMER.$suggestSolution             = "TIMER6";
enet_cpsw1.MDIO.$suggestSolution          = "MDIO0";
enet_cpsw1.MDIO.MDC.$suggestSolution      = "MDIO0_MDC";
enet_cpsw1.MDIO.MDIO.$suggestSolution     = "MDIO0_MDIO";
enet_cpsw1.RGMII1.$suggestSolution        = "RGMII2";
enet_cpsw1.RGMII1.RD0.$suggestSolution    = "RGMII2_RD0";
enet_cpsw1.RGMII1.RD1.$suggestSolution    = "RGMII2_RD1";
enet_cpsw1.RGMII1.RD2.$suggestSolution    = "RGMII2_RD2";
enet_cpsw1.RGMII1.RD3.$suggestSolution    = "RGMII2_RD3";
enet_cpsw1.RGMII1.RX_CTL.$suggestSolution = "RGMII2_RX_CTL";
enet_cpsw1.RGMII1.RXC.$suggestSolution    = "RGMII2_RXC";
enet_cpsw1.RGMII1.TD0.$suggestSolution    = "RGMII2_TD0";
enet_cpsw1.RGMII1.TD1.$suggestSolution    = "RGMII2_TD1";
enet_cpsw1.RGMII1.TD2.$suggestSolution    = "RGMII2_TD2";
enet_cpsw1.RGMII1.TD3.$suggestSolution    = "RGMII2_TD3";
enet_cpsw1.RGMII1.TX_CTL.$suggestSolution = "RGMII2_TX_CTL";
enet_cpsw1.RGMII1.TXC.$suggestSolution    = "RGMII2_TXC";
enet_cpsw1.RGMII2.$suggestSolution        = "RGMII1";
enet_cpsw1.RGMII2.RD0.$suggestSolution    = "RGMII1_RD0";
enet_cpsw1.RGMII2.RD1.$suggestSolution    = "RGMII1_RD1";
enet_cpsw1.RGMII2.RD2.$suggestSolution    = "RGMII1_RD2";
enet_cpsw1.RGMII2.RD3.$suggestSolution    = "RGMII1_RD3";
enet_cpsw1.RGMII2.RX_CTL.$suggestSolution = "RGMII1_RX_CTL";
enet_cpsw1.RGMII2.RXC.$suggestSolution    = "RGMII1_RXC";
enet_cpsw1.RGMII2.TD0.$suggestSolution    = "RGMII1_TD0";
enet_cpsw1.RGMII2.TD1.$suggestSolution    = "RGMII1_TD1";
enet_cpsw1.RGMII2.TD2.$suggestSolution    = "RGMII1_TD2";
enet_cpsw1.RGMII2.TD3.$suggestSolution    = "RGMII1_TD3";
enet_cpsw1.RGMII2.TX_CTL.$suggestSolution = "RGMII1_TX_CTL";
enet_cpsw1.RGMII2.TXC.$suggestSolution    = "RGMII1_TXC";
